Revit 2027 API
DirectShapeType.Create(Document, String, ElementId, DirectShapeTypeOptions) Method
 Creates a DirectShapeType element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static DirectShapeType Create(
	Document document,
	string name,
	ElementId categoryId,
	DirectShapeTypeOptions options
)
Public Shared Function Create (
	document As Document,
	name As String,
	categoryId As ElementId,
	options As DirectShapeTypeOptions
) As DirectShapeType
public:
static DirectShapeType^ Create(
	Document^ document,
	String^ name,
	ElementId^ categoryId,
	DirectShapeTypeOptions^ options
)
static member Create :
        document : Document *
        name : string *
        categoryId : ElementId *
        options : DirectShapeTypeOptions -> DirectShapeType
Parameters
document Document
 Document to which the created element will be added.
name String
 Name of the DirectShapeType.
categoryId ElementId
 Id of the category assigned to this DirectShapeType. Must be a valid category id.
options DirectShapeTypeOptions
 Options that can be used to control the behavior of DirectShapeType being created.
Return Value
DirectShapeType
 The new DirectShapeType.
Exceptions
Exception | Condition
ArgumentException |  Document document may not contain DirectShape or DirectShapeType objects. -or- Element id categoryId may not be used as a DirectShape category.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShapeType Class
Create Overload
Autodesk.Revit.DB Namespace